Wdbucbicmcocnmoc/smart_car/电磁四轮/软件/Libraries/libraries/STC16Fxx.h
#define PWM1_CR1            (*(unsigned char volatile far *)0x7efec0)
#define PWM1_CR2            (*(unsigned char volatile far *)0x7efec1)
#define PWM1_SMCR           (*(unsigned char volatile far *)0x7efec2)
#define PWM1_ETR            (*(unsigned char volatile far *)0x7efec3)
#define PWM1_IER            (*(unsigned char volatile far *)0x7efec4)
#define PWM1_SR1            (*(unsigned char volatile far *)0x7efec5)
#define PWM1_SR2            (*(unsigned char volatile far *)0x7efec6)
#define PWM1_EGR            (*(unsigned char volatile far *)0x7efec7)
#define PWM1_CCMR1          (*(unsigned char volatile far *)0x7efec8)
#define PWM1_CCMR2          (*(unsigned char volatile far *)0x7efec9)
#define PWM1_CCMR3          (*(unsigned char volatile far *)0x7efeca)
#define PWM1_CCMR4          (*(unsigned char volatile far *)0x7efecb)
#define PWM1_CCER1          (*(unsigned char volatile far *)0x7efecc)
#define PWM1_CCER2          (*(unsigned char volatile far *)0x7efecd)
#define PWM1_CNTRH          (*(unsigned char volatile far *)0x7efece)
#define PWM1_CNTRL          (*(unsigned char volatile far *)0x7efecf)
#define PWM1_PSCRH          (*(unsigned char volatile far *)0x7efed0)
#define PWM1_PSCRL          (*(unsigned char volatile far *)0x7efed1)
#define PWM1_ARRH           (*(unsigned char volatile far *)0x7efed2)
#define PWM1_ARRL           (*(unsigned char volatile far *)0x7efed3)
#define PWM1_RCR            (*(unsigned char volatile far *)0x7efed4)
#define PWM1_CCR1H          (*(unsigned char volatile far *)0x7efed5)
#define PWM1_CCR1L          (*(unsigned char volatile far *)0x7efed6)
#define PWM1_CCR2H          (*(unsigned char volatile far *)0x7efed7)
#define PWM1_CCR2L          (*(unsigned char volatile far *)0x7efed8)
#define PWM1_CCR3H          (*(unsigned char volatile far *)0x7efed9)
#define PWM1_CCR3L          (*(unsigned char volatile far *)0x7efeda)
#define PWM1_CCR4H          (*(unsigned char volatile far *)0x7efedb)
#define PWM1_CCR4L          (*(unsigned char volatile far *)0x7efedc)
#define PWM1_BKR            (*(unsigned char volatile far *)0x7efedd)
#define PWM1_DTR            (*(unsigned char volatile far *)0x7efede)
#define PWM1_OISR           (*(unsigned char volatile far *)0x7efedf)

#define PWM2_CR1            (*(unsigned char volatile far *)0x7efee0)
#define PWM2_CR2            (*(unsigned char volatile far *)0x7efee1)
#define PWM2_SMCR           (*(unsigned char volatile far *)0x7efee2)
#define PWM2_ETR            (*(unsigned char volatile far *)0x7efee3)
#define PWM2_IER            (*(unsigned char volatile far *)0x7efee4)
#define PWM2_SR1            (*(unsigned char volatile far *)0x7efee5)
#define PWM2_SR2            (*(unsigned char volatile far *)0x7efee6)
#define PWM2_EGR            (*(unsigned char volatile far *)0x7efee7)
#define PWM2_CCMR1          (*(unsigned char volatile far *)0x7efee8)
#define PWM2_CCMR2          (*(unsigned char volatile far *)0x7efee9)
#define PWM2_CCMR3          (*(unsigned char volatile far *)0x7efeea)
#define PWM2_CCMR4          (*(unsigned char volatile far *)0x7efeeb)
#define PWM2_CCER1          (*(unsigned char volatile far *)0x7efeec)
#define PWM2_CCER2          (*(unsigned char volatile far *)0x7efeed)
#define PWM2_CNTRH          (*(unsigned char volatile far *)0x7efeee)
#define PWM2_CNTRL          (*(unsigned char volatile far *)0x7efeef)

#define PWM2_PSCRH          (*(unsigned char volatile far *)0x7efef0)
#define PWM2_PSCRL          (*(unsigned char volatile far *)0x7efef1)
#define PWM2_ARRH           (*(unsigned char volatile far *)0x7efef2)
#define PWM2_ARRL           (*(unsigned char volatile far *)0x7efef3)
#define PWM2_RCR            (*(unsigned char volatile far *)0x7efef4)
#define PWM2_CCR1H          (*(unsigned char volatile far *)0x7efef5)
#define PWM2_CCR1L          (*(unsigned char volatile far *)0x7efef6)
#define PWM2_CCR2H          (*(unsigned char volatile far *)0x7efef7)
#define PWM2_CCR2L          (*(unsigned char volatile far *)0x7efef8)
#define PWM2_CCR3H          (*(unsigned char volatile far *)0x7efef9)
#define PWM2_CCR3L          (*(unsigned char volatile far *)0x7efefa)
#define PWM2_CCR4H          (*(unsigned char volatile far *)0x7efefb)
#define PWM2_CCR4L          (*(unsigned char volatile far *)0x7efefc)
#define PWM2_BKR            (*(unsigned char volatile far *)0x7efefd)
#define PWM2_DTR            (*(unsigned char volatile far *)0x7efefe)
#define PWM2_OISR           (*(unsigned char volatile far *)0x7efeff)

#define PWMA_CR1            (*(unsigned char volatile far *)0x7efec0)
#define PWMA_CR2            (*(unsigned char volatile far *)0x7efec1)
#define PWMA_SMCR           (*(unsigned char volatile far *)0x7efec2)
#define PWMA_ETR            (*(unsigned char volatile far *)0x7efec3)
#define PWMA_IER            (*(unsigned char volatile far *)0x7efec4)
#define PWMA_SR1            (*(unsigned char volatile far *)0x7efec5)
#define PWMA_SR2            (*(unsigned char volatile far *)0x7efec6)
#define PWMA_EGR            (*(unsigned char volatile far *)0x7efec7)
#define PWMA_CCMR1          (*(unsigned char volatile far *)0x7efec8)
#define PWMA_CCMR2          (*(unsigned char volatile far *)0x7efec9)
#define PWMA_CCMR3          (*(unsigned char volatile far *)0x7efeca)
#define PWMA_CCMR4          (*(unsigned char volatile far *)0x7efecb)
#define PWMA_CCER1          (*(unsigned char volatile far *)0x7efecc)
#define PWMA_CCER2          (*(unsigned char volatile far *)0x7efecd)
#define PWMA_CNTRH          (*(unsigned char volatile far *)0x7efece)
#define PWMA_CNTRL          (*(unsigned char volatile far *)0x7efecf)
#define PWMA_PSCRH          (*(unsigned char volatile far *)0x7efed0)
#define PWMA_PSCRL          (*(unsigned char volatile far *)0x7efed1)
#define PWMA_ARRH           (*(unsigned char volatile far *)0x7efed2)
#define PWMA_ARRL           (*(unsigned char volatile far *)0x7efed3)
#define PWMA_RCR            (*(unsigned char volatile far *)0x7efed4)
#define PWMA_CCR1H          (*(unsigned char volatile far *)0x7efed5)
#define PWMA_CCR1L          (*(unsigned char volatile far *)0x7efed6)
#define PWMA_CCR2H          (*(unsigned char volatile far *)0x7efed7)
#define PWMA_CCR2L          (*(unsigned char volatile far *)0x7efed8)
#define PWMA_CCR3H          (*(unsigned char volatile far *)0x7efed9)
#define PWMA_CCR3L          (*(unsigned char volatile far *)0x7efeda)
#define PWMA_CCR4H          (*(unsigned char volatile far *)0x7efedb)
#define PWMA_CCR4L          (*(unsigned char volatile far *)0x7efedc)
#define PWMA_BKR            (*(unsigned char volatile far *)0x7efedd)
#define PWMA_DTR            (*(unsigned char volatile far *)0x7efede)
#define PWMA_OISR           (*(unsigned char volatile far *)0x7efedf)

